lvx/base/DataProcessors/бит_Служебный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_Служебный</Name>
			<Comment>Не используется в конфигурации.</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаВнешнихПодключений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьСПрефиксомБит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьСправочники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПланыВидовХарактеристик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПланыОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПланыСчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПланыВидовРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьПроцессы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПодключений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРасположения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяБазы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПути</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПрочитаны</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеАнализировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/DataProcessors/бит_Служебный/Forms/НастройкаПодключения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.СтруктураПодключения = Неопределено Тогда
		ИД = Новый УникальныйИдентификатор;
		ИД = СтрЗаменить(ИД, "-", "");
		ИД = "ИД_" + ИД;
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураПодключения);
	КонецЕсли;      	
	
	УстановитьПривилегированныйРежим(Истина);
	ХранимыйПароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИД);
	УстановитьПривилегированныйРежим(Ложь);
	
	Пароль = ?(ЗначениеЗаполнено(ХранимыйПароль), ЭтотОбъект.УникальныйИдентификатор, "");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если ТипРасположения <> 1
		И НЕ ПустаяСтрока(Текст) Тогда
		ТипРасположения = 1;
		Путь            = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяСервераИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если ТипРасположения <> 2
		И НЕ ПустаяСтрока(Текст) Тогда
		ТипРасположения = 2;
		ИмяСервера      = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяБазыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если ТипРасположения <> 2
		И НЕ ПустаяСтрока(Текст) Тогда
		ТипРасположения = 2;
		ИмяБазы         = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаголовокВыбора = НСтр("ru='Каталог информационной базы';
							|en='Directory information base'");
	ОписаниеОповещенияДиалогаВыбора = Новый ОписаниеОповещения("ПутьЗавершениеВыбора", ЭтотОбъект);
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещенияДиалогаВыбора, ЗаголовокВыбора, Путь);
	
КонецПроцедуры

// Обработчик завершения выбора пути.
//  См. Синтакс-помощник: ДиалогВыбораФайла.Показать().
//
&НаКлиенте
Процедура ПутьЗавершениеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		Путь = ВыбранныеФайлы[0];
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПарольИзменен = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранитьИзменения(Команда)
	
	Если ПустаяСтрока(Наименование) Тогда
		ТекстСообщения = НСтр("ru='Укажите наименование информационной базы';
							  |en='Specify the name of the knowledge base'");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле  = "Наименование";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ТипРасположения = 0 Тогда
		ПредставлениеПути = НСтр("ru = 'Текущая ИБ'; en = 'Текущая ИБ'")
	ИначеЕсли ТипРасположения = 1 Тогда
		ПредставлениеПути = "File = ""%1"";";
		ПредставлениеПути = СтрШаблон(ПредставлениеПути, Путь);
	ИначеЕсли ТипРасположения = 2 Тогда
		ПредставлениеПути = "Srvr=""%1"";Ref=""%2"";";
		ПредставлениеПути = СтрШаблон(ПредставлениеПути, ИмяСервера, ИмяБазы);
	КонецЕсли;
	
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("ИД"               , ИД);
	НастройкиПодключения.Вставить("Наименование"     , Наименование);
	НастройкиПодключения.Вставить("ПредставлениеПути", ПредставлениеПути);
	НастройкиПодключения.Вставить("ТипРасположения"  , ТипРасположения);
	НастройкиПодключения.Вставить("ИмяСервера"       , ИмяСервера);
	НастройкиПодключения.Вставить("ИмяБазы"          , ИмяБазы);
	НастройкиПодключения.Вставить("Путь"             , Путь);
	НастройкиПодключения.Вставить("Пользователь"     , Пользователь);
	НастройкиПодключения.Вставить("НеАнализировать"  , НеАнализировать);
	
	Если ПарольИзменен Тогда
		ИзменитьПароль();
	КонецЕсли;
	
	Закрыть(НастройкиПодключения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьПароль()
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ИД, Пароль);
	УстановитьПривилегированныйРежим(Ложь);
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
	
КонецПроцедуры

#КонецОбласти
